src/Documents/ВыпускГотовойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВыпускГотовойПродукции</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ВыпускГотовойПродукции/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает выборку товаров документа сгруппированных по Номенклатуре
// Параметры:
//  документСсылка - ДокументСсылка.ВыпускГотовойПродукции
//  выгрузить - Булево - Если Истина результат запроса будет выгружен в `ТаблицуЗначений`
// Возвращаемое значение:
//  - ВыборкаИзРезультатаЗапроса
//  - ТаблицаЗначений
//      * Номенклатура - СправочникСсылка.Номенклатура
//      * Количество - Число
//  - Неопределено - Если таблица не заполнена
Функция ПолучитьТоварыДокумента(Знач документСсылка, Знач выгрузить = Истина) Экспорт
    запросТовары = Новый Запрос;
    запросТовары.УстановитьПараметр("Ссылка", документСсылка);
    запросТовары.Текст =
        "ВЫБРАТЬ
        |	ВыпускГотовойПродукции.Номенклатура КАК Номенклатура,
        |	СУММА(ВыпускГотовойПродукции.Количество) КАК Количество
        |ИЗ
        |	Документ.ВыпускГотовойПродукции.Товары КАК ВыпускГотовойПродукции
        |ГДЕ
        |	ВыпускГотовойПродукции.Ссылка = &Ссылка
        |
        |СГРУППИРОВАТЬ ПО
        |	ВыпускГотовойПродукции.Номенклатура
        |";

    результатЗапроса = запросТовары.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    Если выгрузить = Истина Тогда
        Возврат результатЗапроса.Выгрузить();
    Иначе
        Возврат результатЗапроса.Выбрать();
    КонецЕсли;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
